function getName() {
	let name = prompt("Введите своё имя...");

	if(name == "" || name == null) {
		name = "Ученик";
	}

	alert(name + ", нажми ОК чтобы начать тест.");
	return name;
}

function test() {
	const name = getName();

	const questions = ["2+2=", "3+2=", "Перечислите животных: 1)собака 2)пенал 3)лошадь (через запятую)", 
	"Перечислите цветы: 1)кот 2)кактус 3)роза (через запятую)", "10/5","Перечислите одежду: 1)клей 2)пакет 3)штаны", 
	"Сколько лет Владимиру Зеленскому: 36, 42, 56", "Первая женщина-космонавт: 1)Валентина Терешкова, 2)Елена Кондакова, 3)Светлана Савицкая",
	"Выберите блюдо: 1)яблоко, 2)суп, 3)трава", "Сколько всего месяцев: 6, 17, 12"];
	const answers = ["4", "5", "1,3", "2,3", "2", "3", "42", "1", "2", "12"];
	
	let score = 0;
	for(let i = 0; i < questions.length; i++) {
		let q = questions[i];
		let a = answers[i];
		let otvet = prompt("Вопрос №" + (i+1) + ": " + q);

		if (otvet == a) {
			score ++;
		}
	}

	alert(name + ", вы набрали " + score + "/" + questions.length + "баллов.");
}